Tekla Open API Reference for Tekla Structures 2025
WpfMeshCatalog Properties
The WpfMeshCatalog type exposes the following members.
Properties
Name | Description
ButtonHeight
 Gets and sets the height of the button control.
ButtonText
 Gets and sets the text of the button control.
ButtonWidth
 Gets and sets the width of the button control.
SelectedMeshGrade
 The mesh grade in the control.
SelectedMeshName
 The mesh name in the control.
Top
See Also
Reference
WpfMeshCatalog Class
Tekla.Structures.Dialog.UIControls Namespace